# [01]

In [ ]:
안녕하세요. 이세무사입니다.
엑셀로는 뭔가 부족하거나 번거롭다고 느끼지만
프로그래밍 언어를 배우는것은 좀 오버인것 같다고 생각하시는 분들에게 도움이 될듯합니다.
파이썬 문법을 따로배우지 않고 파이썬의 pandas라이브러리만을 주로 이용해서
엑셀에 있는 데이터를 가공하겠습니다.
강의를 보고 쓸만하다고 판단되면 컴퓨터에 파이썬을 설치하시면 됩니다.
쥬피터노트북 설치는 포털에서 검색하시면 될거 같습니다.

In [5]:
import pandas as pd
import easygui

# 엑셀자료를 가져오기전에 표형식의 자료를 파이썬에서 한번 만들어보겠습니다.
# 동아리 회원 표를 만든다고 생각해보겠습니다.
인원리스트 = [[i,i+1,i+2,i+3] for i in range(1,18,4)]

In [76]:
인원리스트

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20]]

In [79]:
시프레임 = pd.DataFrame(인원리스트, columns=['최', '박', '이', '김'], 
                       index=['수원', '화성', '용인', '청주', '충주'])

In [80]:
시프레임

     최   박   이   김
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20

In [81]:
시프레임.sum()

최    45
박    50
이    55
김    60
dtype: int64

In [40]:
시프레임.sum().to_frame('city')

   city
최    45
박    50
이    55
김    60

In [41]:
시프레임.sum(axis=1)

수원    10
화성    26
용인    42
청주    58
충주    74
dtype: int64

In [82]:
시프레임.sum(axis=1).to_frame('총인원')

    총인원
수원   10
화성   26
용인   42
청주   58
충주   74

In [2]:
if 0:
    filename1 = easygui.fileopenbox()
else :
    filename1 = 'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx' #C:\excel_python

In [3]:
filename1

'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx'

In [6]:
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0)
#df0 = workbook1.parse(sheetname=0, index_col=0)

In [7]:
df0

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  17
4  충주  18  19  20  21

In [8]:
df0 = df0.set_index('시')

In [9]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21

In [11]:
#오늘은 여기까지입니다.

# [02]

In [ ]:
엑셀에 vba 앱이 있어서 몇년간 써왔었는데요
데이터 포맷이 변경이 되면 코드를 매번 수정해야해서
가성비가 좋은편은 아닙니다.
전편에 이어 하도록 하겠습니다.

In [101]:
df0 # 도시명이 인덱스고 성씨가 칼럼입니다.

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21

In [103]:
df0.values.tolist()

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 17],
 [18, 19, 20, 21]]

In [104]:
df0.columns

Index(['최', '박', '이', '김'], dtype='object')

In [105]:
df0.index

Index(['수원', '화성', '용인', '청주', '충주'], dtype='object', name='시')

In [10]:
df1 = workbook1.parse(sheetname=1, index_col=0)

In [11]:
df1

     도
시
수원  경기
화성  경기
용인  경기
청주  충북
충주  충북

In [12]:
df0.sum()

최    46
박    51
이    56
김    62
dtype: int64

In [13]:
df0.sum(axis=1)

시
수원    10
화성    26
용인    42
청주    59
충주    78
dtype: int64

In [14]:
df01 = df0.join(df1)

In [15]:
df01

     최   박   이   김   도
시
수원   1   2   3   4  경기
화성   5   6   7   8  경기
용인   9  10  11  12  경기
청주  13  14  15  17  충북
충주  18  19  20  21  충북

In [89]:
df01=df01.reset_index().set_index(['도','시'])

In [90]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  17
   충주  18  19  20  21

In [ ]:
데이터프레임의 사이즈가 크면 쥬피터노트북에서는 열과 행을 생략해서 보여주는데
이럴 경우에는 엑셀로 확인하면 편합니다.
사이즈가 큰 데이터프레임을 엑셀화일로 저장해서 확인할수 있지만
최종생산물이 아닐 데이터 확인을 할 목적 클립보드로 복사해서 활용하는게 편합니다.

In [168]:
df01.to_clipboard() # 클립보드 내용을 엑셀에 붙여넣었을때와 쥬피터노트북 결과물을 복사해서 붙여넣기 비교

In [167]:
df01.loc['경기']

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [20]:
df01.loc['경기','수원'].to_frame('인원')

   인원
최   1
박   2
이   3
김   4

In [21]:
df01.loc[('경기','수원'),'김']

4

In [160]:
df01.sum().to_frame('인원')

   인원
최  46
박  51
이  56
김  62

In [162]:
df01.sum(axis=1).to_frame('인원')

       인원
도  시
경기 수원  10
   화성  26
   용인  42
충북 청주  59
   충주  78

In [164]:
df01.T

도 경기         충북
시 수원 화성  용인  청주  충주
최  1  5   9  13  18
박  2  6  10  14  19
이  3  7  11  15  20
김  4  8  12  17  21

In [165]:
df01.T.sum().to_frame('인원')

       인원
도  시
경기 수원  10
   화성  26
   용인  42
충북 청주  59
   충주  78

In [169]:
df01.loc['경기']

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [22]:
df01.loc['경기'].sum()

최    15
박    18
이    21
김    24
dtype: int64

In [23]:
df01.loc['경기'].sum().to_frame('경기도')

   경기도
최   15
박   18
이   21
김   24

In [24]:
df01.loc['경기'].sum(axis=1)

시
수원    10
화성    26
용인    42
dtype: int64

In [25]:
df01.loc['경기'].sum(axis=1).to_frame('경기도')

    경기도
시
수원   10
화성   26
용인   42

In [158]:
df01.loc[:,'김'].to_frame('김씨 인원')

       김씨 인원
도  시
경기 수원      4
   화성      8
   용인     12
충북 청주     17
   충주     21

In [100]:
df01.loc[:,('김','이')]

        김   이
도  시
경기 수원   4   3
   화성   8   7
   용인  12  11
충북 청주  17  15
   충주  21  20

In [106]:
df01.loc[:,'박':'김']

        박   이   김
도  시
경기 수원   2   3   4
   화성   6   7   8
   용인  10  11  12
충북 청주  14  15  17
   충주  19  20  21

In [91]:
df01[['김','이']]

        김   이
도  시
경기 수원   4   3
   화성   8   7
   용인  12  11
충북 청주  17  15
   충주  21  20

In [92]:
df01[df01.isin([10,20])].dropna(how='all')

        최     박     이   김
도  시
경기 용인 NaN  10.0   NaN NaN
충북 충주 NaN   NaN  20.0 NaN

In [163]:
칠의배수 = [7,14]
df01[df01.isin(칠의배수)].dropna(how='all')

        최     박    이   김
도  시
경기 화성 NaN   NaN  7.0 NaN
충북 청주 NaN  14.0  NaN NaN

In [85]:
df01[df01.index.isin([('경기','화성')])]

       최  박  이  김
도  시
경기 화성  5  6  7  8

In [26]:
#df01 = df01.reset_index()

In [136]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  17
   충주  18  19  20  21

In [138]:
df01.groupby(level='도').sum()

     최   박   이   김
도
경기  15  18  21  24
충북  31  33  35  38

In [139]:
df01.loc['경기']

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [135]:
df01.groupby((df01.columns), axis=1).sum() #axis?

        김   박   이   최
도  시
경기 수원   4   2   3   1
   화성   8   6   7   5
   용인  12  10  11   9
충북 청주  17  14  15  13
   충주  21  19  20  18

In [65]:
df01.groupby(level='도')['김'].sum()

도
경기    24
충북    38
Name: 김, dtype: int64

In [60]:
df01.groupby(level='시').sum()

     최   박   이   김
시
수원   1   2   3   4
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21
화성   5   6   7   8

In [61]:
df01.groupby(level=['도','시']).sum()

        최   박   이   김
도  시
경기 수원   1   2   3   4
   용인   9  10  11  12
   화성   5   6   7   8
충북 청주  13  14  15  17
   충주  18  19  20  21

In [62]:
df01.groupby(level=['시','도']).sum()

        최   박   이   김
시  도
수원 경기   1   2   3   4
용인 경기   9  10  11  12
청주 충북  13  14  15  17
충주 충북  18  19  20  21
화성 경기   5   6   7   8

In [69]:
df01.groupby(level=['도'])['김','이'].agg(['sum','max'])

     김       이
   sum max sum max
도
경기  24  12  21  11
충북  38  21  35  20

In [109]:
df01.groupby(level=['도'])['김','이'].agg(['sum','mean'])

     김        이
   sum mean sum  mean
도
경기  24    8  21   7.0
충북  38   19  35  17.5

In [71]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  17
   충주  18  19  20  21

In [72]:
df01rs = df01.reset_index()

In [73]:
df01rs

    도   시   최   박   이   김
0  경기  수원   1   2   3   4
1  경기  화성   5   6   7   8
2  경기  용인   9  10  11  12
3  충북  청주  13  14  15  17
4  충북  충주  18  19  20  21

In [74]:
df01rs[df01rs['도'].isin(['경기'])]

    도   시  최   박   이   김
0  경기  수원  1   2   3   4
1  경기  화성  5   6   7   8
2  경기  용인  9  10  11  12

In [75]:
df01rs[df01rs['시'].isin(['화성','청주'])]

    도   시   최   박   이   김
1  경기  화성   5   6   7   8
3  충북  청주  13  14  15  17